/*
    задание:
    Вторая программа (Program2)
    Функции:

    1. Моргание светодиодом два раза с интервалом в 500 мс между миганиями.
    2. Ожидание нажатия кнопки для перехода к третьей программе (Program3).
    3. Мигание светодиодом раз в секунду (сообщает о работе).
    Требования:

    а) Использовать GPIO для управления светодиодом и чтения состояния кнопки.
    б) Реализовать устойчивую обработку нажатий кнопки.
    в) После подтверждения нажатия кнопки перейти к Program3.
    г) Каждую секунду мигает светодиод показывая о работе во второй программе 
    д) Обработка ошибок: надёжная обработка возможных ошибок
*/

void app_main() 
{
    
}